tutorial/turbine-tower/fluid-rotor/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/initialConditions";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentK;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    tower
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    rotor
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    floor
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "externalDomain_.*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
