tutorial/turbine-tower/fluid-rotor/constant/dynamicMeshDict.multi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

solver          multiSolidBodyMotionSolver;
#include "${FOAM_CASE}/initialConditions"

multiSolidBodyMotionSolverCoeffs
{
	dynamicZone
	{
	  solidBodyMotionFunction  rotatingMotion;
	  rotatingMotionCoeffs
	  {
	      origin     (-6 0 150);
	      axis        $axis;
	      omega       $rad_s;  // rad/s
	  }
	}
	/*
	tower
	{
		solidBodyMotionFunction  displacementLaplacian;
		displacementLaplacianCoeffs 
		{
		    diffusivity quadratic inverseDistance (tower);
		}
	}
	*/
}
// ************************************************************************* //
