tutorial/turbine-tower/fluid-rotor/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh        on;
snap                   on;
addLayers              on;

geometry
{
    tower
    {
        type        triSurfaceMesh;
        file        "tower.stl";
    }        
    rotor
    {
        type        triSurfaceMesh;
        file        "rotor.stl";
    }    
    dynamicZone
    {
        type            searchableCylinder;
        point1          (-14 0 150);
        point2          (-6 0 150);
        radius          125;
    }     
    waveZone
    {
        type        searchableBox;
        min         (-200 -200  25);
        max         ( 500  200  35);
        
    } 
};


// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells              100000;
    maxGlobalCells           20000000;
    minRefinementCells              0;
    maxLoadUnbalance             0.05;
    nCellsBetweenLevels             4;
    features
    (
        {
            file        "tower.eMesh";
            level                   3;
        }        
        {
            file        "rotor.eMesh";
            level                   4;
        }        
    );

    refinementSurfaces
    {
        rotor
        {
            level                    (4 4);
        }    
        tower
        {
            level                    (3 3);
        }
        dynamicZone
        {
            level                    (3 3);
            cellZone                 dynamicZone;
            faceZone                 dynamicZone;
            mode                     inside;
        }
    }

    refinementRegions
    {
        dynamicZone
        {
            mode        inside;
            levels      ((1E15 3));
        }        
        waveZone
        {
            mode        inside;
            levels      ((1E15 2));
        }
    }

    resolveFeatureAngle                60;
    locationInMesh             (33 33 33);
    allowFreeStandingZoneFaces     false;
}




// Settings for the snapping.
snapControls
{
    implicitFeatureSnap       off;
    explicitFeatureSnap       on;
    multiRegionFeatureSnap    on;
}


// Settings for the layer addition.
addLayersControls
{
    layers
    {
        tower
        {
            nSurfaceLayers                       10;
        }        
        rotor
        {
            nSurfaceLayers                       10;
        }
    }
    relativeSizes                                on;
    expansionRatio                             1.05;
    thickness                                     1;
    minThickness                                0.1;
    featureAngle                                130;
}

mergeTolerance 1e-6;

// ************************************************************************* //
